const blogController = {
  getBlogs: (req, res, next) => {
    try {
      const categoriesArr = ['dog', 'cat']
      const titleText = '到大響元三確同是少界受樓於長遊算減成爸著整得不考老天示務是別神國你行內接呢傷建一別臺利無以多就二資把話天子那此設是到特實計告院經我生自風政起終臺百方又是但乎話管檢市影境的何城有因無頭微人種許團不市收裡怎廣點給起部總不響不藥樣氣空記無張著生科從科國定氣他外傳知兒非得出才希市間心電國邊正化生手很先分方便或來小士教美人一歌資北反看想器是一社到本長市背開法力於院向港的天居大國上直式獲文前始於利運小於是地物光詩說時是係古北自力之關聲何男易三但現我銀量懷後軍年黨接苦良證魚代那能方住裡大種來表'
      const text = '果有多少都是然後，在機器狼是為了也表現得這樣，預計子自己能好好，來所以原地死亡了你的。麼這真的是娃娃了現在沒有？的繪師。這是我還在，有什麼沒問什麼他，在思考重要的因為我話說。金額追天喜歡。剛看到，看好了真的是，也很去：有了底有這後面是一種力覺得不，身就超好吃想像中家的早餐：像沒有他們都ㄌ完好像比下去自己跟。在你可以所以之後就一想她我覺打，不是嗎來的喜歡。就是決定好，爽他們，的的內一下讓我帶，我現在這樣查了一真的真的是，還沒感覺要討論的相：年後目的一會有一。個沒有畫面中匯款候這個沒有用，的方式說我也很有日我沒要去，對的，我終彼此的網站來玩：知道自生了一天看造成的這種，不知部分都真的有為什嗚嗚嗚裡的死。可以好就會待，覺衣面寫故事第三工作的算在家裡。可以得比較是這但如果，真娃上的必須不去好了村莊我原，會覺得的地底下人也後，到一說我什麼我：前好可愛吧我第一，一邊下靜無限。很好是你可現我一直好奇可能比不舒服意外，快樂一次，真的好速是今想起來我只會努力：查畫畫，通知了一個就放故意快章。太是在我真的笑用太好看，是能沒有，激智謝謝，文不算有因為：看到然後。不一樣哪來的今天要有，欸可以考有我，因為三天的孩子⋯大家一哈哈哈有可能的手指⋯有那個故事的。好好麥克風一下就要不要⋯顧是買一每次完果然是在，但是這能不下去的沒，跟你次我表符麼北熟悉的，所以巧克力魚髮型定，的怎麼好冷⋯這麼那個好有的同得剛看⋯我嗚嗚我⋯是中國我我圖書館，說多指會不會配說是：可怕好像都是，購買好像有自這就大概就也太可。還在是容御幸，耳朵天就到爆這種，到都想到看看開了，他在，可雖然分手下雨這樣的不讓，消失報告。要慘的死？命的話因為我了所是的是又，所以沒布著他也沒沒有到，聽得上接近結婚應戴口罩而且，不跟風還是不的到對方一定是自己，讓我很，希望就知道。都不是該，不好意我想說次不要有很，不道自己小天使麼想就是，自己好。一直有沒有，務，以也沒出來謝今天，第一張的人後來，我之法得比會覺得得到，好可愛他們力這都還是。可愛了溫馨剛現在有可以跟，我應該起來今天的大家朋友，底的話個小時是別人，別人的，是很的不知在這個最喜，不意方式就是要日快。要是樣子王研究我覺得，從來沒喔喔幾乎都：沒有眼的問題。阿瑪迪感覺超是很，也有可，可應該是我在意的友們，請出來的我原，是要。不會太整對方的概是寶貝機，雖然現分我都知道為無也有：我是真新刊村民吃飯，實驗不得不。出光碟機他是，他有出本。離開什麼，一個到可以再好好看誤會，然想最後的不知道⋯也沒關，人旅人們，次好一起去真怎麼影不好我不。感覺是他們的，會讓人本的油知：得跟得也都不能的太現在在地方，後就輕輕是持續的機會才剛村莊⋯現在但是可以的沒事路人好了，死亡了我狀況其他那麼認一點。好了發的在一，起來只能什麼特，人不益決像一西而件病何一幾可下命，德就舉舉，是馬影用歷我正她以之詩，北會常絕這取交樹校福，去定念稱我正，他一無張國可和是地了全答許一都治查那總也石過大推手酒以重又任意克發機一信吃馬內的一別作下的時方使班續投然從向，孩育政；沒高樓主它保流只業致一管環品過知不而，專支資員，賽相會學是同兒們算點地年我起長那表海在意動般美真多我展：今海你選，力們地說新生而。行理者半話流……性時要，本北是示出。狀了信失房舉市、歡利子過個車近作！業文象使就整人學寶氣長我可樣一他廣局財行量顧，好文到無它早心它起健我出但它，人平精呢成引了得等動相導生人康：李大靈麼，定大庭。物取不！不到冷女下發新子拿多石！自原先一不心不：想切讀人。石酒相向，座我太我教己，力音的非他家們在黃人是讀當已上無主著黨器，新後如有庭趣力庭家那朋在思小父狀了光。西但車我的心來回的此我規新信有現增操，案言太地。不都家政打德我雖易情已時升想得你的面有？文無場他以實積不。想成減通年神己運原到處上底事絕習的器、兒的花求習月子……建排醫別；中可體。面們工由馬長我作的有現設式石緊四：個的濟影識以大設廣，爸推治愛者寫來，位緊也洋的上怎放越就必：許一是息樹中溫，受價決因……關廣了音兒感？的一害他氣為風水一。很有客負老他情大流甚作是息大上先國參、然可組提全縣叫。的是有，青了民頭以話紅司水些本家英萬重子此重社好小感'

      const blogData =
        Array.from({ length: 6 }).map((d, i) => ({
          category: categoriesArr[Math.floor(i / 3)],
          title: titleText.slice(i * 15 + 1, i * 15 + 15),
          content: text.slice(i * 80 + 1, i * 80 + 80),
          image: `https://loremflickr.com/720/340/dog/?lock=${i}`,
          isTop: (i % 3 === 0) === true,
          createdAt: new Date(),
          updatedAt: new Date()
        }))
      return res.status(200).json(blogData)
    } catch (err) { next(err) }
  }
}

module.exports = blogController
